---
kind: property
id: P:Autodesk.Revit.DB.DocumentPreviewSettings.IsViewUpdateForced
source: html/8d9548dc-dae3-c40c-4689-ebdfa14b8cb0.htm
---
# Autodesk.Revit.DB.DocumentPreviewSettings.IsViewUpdateForced Property

Identifies if Revit will update the preview view if necessary.

## Syntax (C#)
```csharp
public bool IsViewUpdateForced { get; }
```

## Remarks
This setting applies only to a single Save operation and is reset to
 false after it is accessed.